
Функция ЭтуКривуюФункциюЗапилилDev1()
	Сообщить("СуперСекретныйKey");	
	Сообщить("СуперСекретныйKey");
	Сообщить("СуперСекретныйKey");
	Сообщить("СуперСекретныйKey");
КонецФункции


Функция Dev2Оптимизатор(ПР)
	
	Для Каждого строка из Пр.Структура.массив Цикл

	Сообщить(Строка);                
КонецЦикла;                                   
   //Это лучший код
КонецФункции

//Dev2
Функция Dev2ОптимизаторСовершенноНоваяФункция(ПР)
	
	Для Каждого строка из Пр.Структура.массив Цикл

	Сообщить(Строка);                
КонецЦикла;                                   
   //Это лучший код
КонецФункции
